In [2]:
import pandas as pd

data = {"Category":["A","B","A","B","A","C"],
        "Sales":[100,200,150,250,200,300],
        "Profit":[10,20,15,25,20,30]
        }

df = pd.DataFrame(data)
df

  Category  Sales  Profit
0        A    100      10
1        B    200      20
2        A    150      15
3        B    250      25
4        A    200      20
5        C    300      30

In [4]:
avg_sales = df.groupby("Category")["Sales"].mean()
avg_sales

Category
A    150.0
B    225.0
C    300.0
Name: Sales, dtype: float64

In [5]:
total = df.groupby("Category")[["Sales","Profit"]].sum()
total

          Sales  Profit
Category
A           450      45
B           450      45
C           300      30

In [6]:
summary = df.groupby("Category").agg({
    "Sales": "max",
    "Profit": "sum"
})
summary

          Sales  Profit
Category
A           200      45
B           250      45
C           300      30